# DataFrame

Data-analytiikan peruskirjasto on <b>pandas</b>. Vakiintuneen tavan mukaan käytän pandas-kirjastosta lyhennettä <b>pd</b>.

Pandas-kirjaston keskeisin tietorakenne on <b>DataFrame</b>. Analysoitavat datat avaan DataFrame-olioon ja analyysien tulostaulukot ovat enimmäkseen DataFrame-olioita.

In [1]:
#otan käyttöön pandas-ohjelmakirjaston
import pandas as pd

#luon dictionary-tyyppisen tietorakenteen
#- dictionaryn ympärillä aina aaltosulkeet {}
#- listan ympärillä aina hakasulkeet []
raw_data = {'Tuote': ['muikkukukko', 'lanttukukko', 'lihalörtsy', 'kasvislörtsy'],
            'Varasto': [8, 10, 5, 7],'Hinta': [15, 12, 3, 3]}

#luon dictionarysta DataFramen, johon viittaan df-nimellä
df = pd.DataFrame(raw_data, columns = ['Tuote', 'Varasto', 'Hinta'])
#Ilman columns-parametria sarakkeet järjestyvät nimen mukaiseen aakkosjärjestykseen

#näytän dataframen
df

          Tuote  Varasto  Hinta
0   muikkukukko        8     15
1   lanttukukko       10     12
2    lihalörtsy        5      3
3  kasvislörtsy        7      3

In [2]:
#dataframen rivien ja sarkkeiden määrä
df.shape

(4, 3)

In [3]:
#rivi-indeksi (dataframen vasemmassa reunassa)
df.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
#sarakeindeksi
df.columns

Index(['Tuote', 'Varasto', 'Hinta'], dtype='object')

In [5]:
#lanttukukon hinta indeksihaulla (1 = lanttukukon rivi, 2 = hinta-sarake)
#huomaa, että indeksien numerointi alkaa nollasta
df.iloc[1, 2]

12

In [6]:
#tiedot lihalörtsyn riviltä (2)
df.iloc[2, :]

Tuote      lihalörtsy
Varasto             5
Hinta               3
Name: 2, dtype: object

In [7]:
#sijoitan tuote-sarakkeen arvot rivi-indeksin arvoiksi
df.index = df['Tuote']
df

                     Tuote  Varasto  Hinta
Tuote
muikkukukko    muikkukukko        8     15
lanttukukko    lanttukukko       10     12
lihalörtsy      lihalörtsy        5      3
kasvislörtsy  kasvislörtsy        7      3

In [8]:
#poistan alkuperäisen Tuote-sarakkeen
df = df.drop('Tuote', axis=1)
df

              Varasto  Hinta
Tuote
muikkukukko         8     15
lanttukukko        10     12
lihalörtsy          5      3
kasvislörtsy        7      3

In [9]:
#loc paikantaa arvon indeksin tunnuksen perusteella
df.loc['lihalörtsy']

Varasto    5
Hinta      3
Name: lihalörtsy, dtype: int64

In [10]:
#lihalörtsyn hinta
df.loc['lihalörtsy','Hinta']

3

In [11]:
#hintatiedot muikkukukosta lanttukukkoon
df.loc['muikkukukko' : 'lanttukukko', 'Hinta']

Tuote
muikkukukko    15
lanttukukko    12
Name: Hinta, dtype: int64

In [12]:
#lasken uuden sarakkeen aikaisempien avulla
df['Arvo'] = df['Varasto'] * df['Hinta']  
df

              Varasto  Hinta  Arvo
Tuote
muikkukukko         8     15   120
lanttukukko        10     12   120
lihalörtsy          5      3    15
kasvislörtsy        7      3    21

In [13]:
#lasken summan Arvo-sarakkeesta
df['Arvo'].sum()

276

In [14]:
#kukkojen varastoarvo
df.loc['muikkukukko':'lanttukukko', 'Arvo'].sum()

240

In [15]:
#lisään %-sarakkeen
df['%'] = df['Arvo']/df['Arvo'].sum()*100
df

              Varasto  Hinta  Arvo          %
Tuote
muikkukukko         8     15   120  43.478261
lanttukukko        10     12   120  43.478261
lihalörtsy          5      3    15   5.434783
kasvislörtsy        7      3    21   7.608696

In [16]:
#lisään dataframeen summarivin
df.loc['Yhteensä'] = df.sum()

#esitän dataframen ilman desimaaleja
df.style.format('{:.0f}')

In [17]:
#T (transpose) vaihtaa dataframen rivit ja sarakkeet
df.T.style.format('{:.0f}')